Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState
The Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState class handles the state of the selected model objects.

Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState.lastState
The collection of the last selected objects.

Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState class.

Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState.LastState
Gets the last state of the last selected model objects.

Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState.IsChanged(System.Collections.Generic.ICollection{Tekla.Structures.Model.ModelObject})
Checks if the state of the selected objects has been changed.
newCollection: The new state of the selected objects.
Returns: True if there is any change in the selected objects; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState.Update(System.Collections.Generic.ICollection{Tekla.Structures.Model.ModelObject},System.Boolean)
Updates the state of the selected objects if any change is detected.
newCollection: The new state of the selected objects.
forceUpdate: A value indicating whether to update the state even if there is no change.
Returns: True if the state was updated; otherwise, false.